[Killed] LogicalOperator
main/components/Commons/CommonsForm.js:8:9
 import HealthUpdateStrategiesDropdown from "main/components/Commons/HealthStrategiesUpdateDropdown";
 
 function CommonsForm({initialCommons, submitAction, buttonLabel = "Create"}) {
-    if (initialCommons && initialCommons.startingDate) {
+    if (initialCommons || initialCommons.startingDate) {
         initialCommons.startingDate = initialCommons.startingDate.split("T")[0];
     }
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'startingDate')

[Killed] ConditionalExpression
main/components/Commons/CommonsForm.js:8:9
 import HealthUpdateStrategiesDropdown from "main/components/Commons/HealthStrategiesUpdateDropdown";
 
 function CommonsForm({initialCommons, submitAction, buttonLabel = "Create"}) {
-    if (initialCommons && initialCommons.startingDate) {
+    if (false) {
         initialCommons.startingDate = initialCommons.startingDate.split("T")[0];
     }
killedBy: CommonsForm tests renders correctly with date cut off
statusReason: Error: expect(element).toHaveValue(2022-03-05T15:50:10)

Expected the element to have value:
  2022-03-05T15:50:10
Received:

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:34:55
     const curr = new Date();
     const today = curr.toISOString().split('T')[0];
     const DefaultVals = {
-        name: "", startingBalance: "10000", cowPrice: "100",
+        name: "", startingBalance: "10000", cowPrice: "",
         milkPrice: "1", degradationRate: null, carryingCapacity: null, startingDate: today
     };
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(100)

Expected the element to have value:
  100
Received:
  null

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:38:68
         milkPrice: "1", degradationRate: null, carryingCapacity: null, startingDate: today
     };
 
-    const belowStrategy = initialCommons?.belowCapacityStrategy || healthUpdateStrategies?.defaultBelowCapacity;
+    const belowStrategy = initialCommons?.belowCapacityStrategy || healthUpdateStrategies.defaultBelowCapacity;
     const aboveStrategy = initialCommons?.aboveCapacityStrategy || healthUpdateStrategies?.defaultAboveCapacity;
 
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'defaultBelowCapacity')

[Killed] ObjectLiteral
main/components/Commons/CommonsForm.js:186:61
                             defaultValue={DefaultVals.degradationRate}
 
                             isInvalid={!!errors.degradationRate}
-                            {...register("degradationRate", {
-                                valueAsNumber: true,
-                                required: "Degradation rate is required",
-                                min: {value: 0.00, message: "Degradation rate must be ≥ 0.00"},
-                            })}
+                            {...register("degradationRate", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: CommonsForm tests has validation errors for required fields
statusReason: TestingLibraryElementError: Unable to find an element with the text: Degradation rate is required. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
