[Killed] ObjectLiteral
main/components/Commons/CommonsForm.js:36:25
 
     const curr = new Date();
     const today = curr.toISOString().split('T')[0];
-    const DefaultVals = {
-        name: "", startingBalance: "10000", cowPrice: "100",
-        milkPrice: "1", degradationRate: null, carryingCapacity: null, startingDate: today
-    };
+    const DefaultVals = {};
 
     const belowStrategy = initialCommons?.belowCapacityStrategy || healthUpdateStrategies?.defaultBelowCapacity;
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(1)

Expected the element to have value:
  1
Received:
  null

[Killed] ObjectLiteral
main/components/Commons/CommonsForm.js:192:38
                             {...register("degradationRate", {
                                 valueAsNumber: true,
                                 required: "Degradation rate is required",
-                                min: {value: 0.00, message: "Degradation rate must be ≥ 0.00"},
+                                min: {},
                             })}
                         />
killedBy: CommonsForm tests has validation errors for values out of range
statusReason: Error: Unable to find an element with the text: /Degradation rate must be ≥ 0.00/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
