[Killed] ConditionalExpression
main/components/Commons/CommonsForm.js:27:25
 
   const testid = "CommonsForm";
 
-  const belowStrategy = initialCommons?.belowCapacityStrategy || healthUpdateStrategies?.defaultBelowCapacity;
+  const belowStrategy = true;
   const aboveStrategy = initialCommons?.aboveCapacityStrategy || healthUpdateStrategies?.defaultAboveCapacity;
   
killedBy: CommonsForm tests renders correctly when an initialCommons is not passed in
statusReason: Error: expect(element).toHaveAttribute("selected") // element.hasAttribute("selected")

Expected the element to have attribute:
  selected
Received:
  null

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:52:22
           data-testid={`${testid}-name`}
           id="name"
           type="text"
-          isInvalid={!!errors.name}
+          isInvalid={!errors.name}
           {...register("name", {required: "Commons name is required"})}
         />
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:67:23
           data-testid={`${testid}-startingBalance`}
           type="number"
           step="0.01"
-          isInvalid={!!errors.startingBalance}
+          isInvalid={!errors.startingBalance}
           {...register("startingBalance", {
             valueAsNumber: true,
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:86:23
           id="cowPrice"
           type="number"
           step="0.01"
-          isInvalid={!!errors.cowPrice}
+          isInvalid={!errors.cowPrice}
           {...register("cowPrice", {
             valueAsNumber: true,
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:105:22
           id="milkPrice"
           type="number"
           step="0.01"
-          isInvalid={!!errors.milkPrice}
+          isInvalid={!errors.milkPrice}
           {...register("milkPrice", {
             valueAsNumber: true,
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:123:22
           data-testid={`${testid}-startingDate`}
           id="startingDate"
           type="date"
-          isInvalid={!!errors.startingDate}
+          isInvalid={!errors.startingDate}
           {...register("startingDate", {
             valueAsDate: true,
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] ObjectLiteral
main/components/Commons/CommonsForm.js:124:40
           id="startingDate"
           type="date"
           isInvalid={!!errors.startingDate}
-          {...register("startingDate", {
-            valueAsDate: true,
-            validate: {
-              isPresent: (v) => !isNaN(v) || "Starting date is required",
-            },
-          })}
+          {...register("startingDate", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: CommonsForm tests has validation errors for required fields
statusReason: TestingLibraryElementError: Unable to find an element with the text: /starting date is required/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Commons/CommonsForm.js:127:33
           {...register("startingDate", {
             valueAsDate: true,
             validate: {
-              isPresent: (v) => !isNaN(v) || "Starting date is required",
+              isPresent: (v) => !isNaN(v) && "Starting date is required",
             },
           })}
killedBy: CommonsForm tests has validation errors for required fields
statusReason: TestingLibraryElementError: Unable to find an element with the text: /starting date is required/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:127:33
           {...register("startingDate", {
             valueAsDate: true,
             validate: {
-              isPresent: (v) => !isNaN(v) || "Starting date is required",
+              isPresent: (v) => isNaN(v) || "Starting date is required",
             },
           })}
killedBy: AdminEditCommonsPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:143:23
           id="degradationRate"
           type="number"
           step="0.001"
-          isInvalid={!!errors.degradationRate}
+          isInvalid={!errors.degradationRate}
           {...register("degradationRate", {
             valueAsNumber: true,
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:147:41
           {...register("degradationRate", {
             valueAsNumber: true,
             required: "Degradation rate is required",
-            min: {value: 0.00, message: "Degradation rate must be ≥ 0.00"},
+            min: {value: 0.00, message: ""},
           })}
         />
killedBy: CommonsForm tests has validation errors for values out of range
statusReason: Error: Unable to find an element with the text: /Degradation rate must be ≥ 0.00/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:180:22
           id="carryingCapacity"
           type="number"
           step="1"
-          isInvalid={!!errors.carryingCapacity}
+          isInvalid={!errors.carryingCapacity}
           {...register("carryingCapacity", {
             valueAsNumber: true,
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control
