[Killed] ArrowFunction
src/main/pages/AdminEditCommonsPage.js:25:34
     );
 
 
-  const objectToAxiosPutParams = (commons) => ({
-    url: "/api/commons/update",
-    method: "PUT",
-    params: {
-      id: commons.id,
-    },
-    data: {
-        "name": commons.name,
-        "startingBalance": commons.startingBalance,
-        "cowPrice": commons.cowPrice,
-        "milkPrice": commons.milkPrice,
-        "startingDate": commons.startingDate,
-        "degradationRate": commons.degradationRate,
-        "capacityPerUser": commons.capacityPerUser,
-        "carryingCapacity": commons.carryingCapacity,
-        "aboveCapacityHealthUpdateStrategy": commons.aboveCapacityHealthUpdateStrategy,
-        "belowCapacityHealthUpdateStrategy": commons.belowCapacityHealthUpdateStrategy,
-        "showLeaderboard": commons.showLeaderboard,
-    }
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (_, commons) => {
killedBy: AdminEditCommonsPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
src/main/pages/AdminEditCommonsPage.js:25:48
     );
 
 
-  const objectToAxiosPutParams = (commons) => ({
-    url: "/api/commons/update",
-    method: "PUT",
-    params: {
-      id: commons.id,
-    },
-    data: {
-        "name": commons.name,
-        "startingBalance": commons.startingBalance,
-        "cowPrice": commons.cowPrice,
-        "milkPrice": commons.milkPrice,
-        "startingDate": commons.startingDate,
-        "degradationRate": commons.degradationRate,
-        "capacityPerUser": commons.capacityPerUser,
-        "carryingCapacity": commons.carryingCapacity,
-        "aboveCapacityHealthUpdateStrategy": commons.aboveCapacityHealthUpdateStrategy,
-        "belowCapacityHealthUpdateStrategy": commons.belowCapacityHealthUpdateStrategy,
-        "showLeaderboard": commons.showLeaderboard,
-    }
-  });
+  const objectToAxiosPutParams = (commons) => ({});
 
   const onSuccess = (_, commons) => {
killedBy: AdminEditCommonsPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>
