[Killed] ArrayDeclaration
main/components/Commons/CommonsTable.js:19:9
     const deleteMutation = useBackendMutation(
         cellToAxiosParamsDelete,
         { onSuccess: onDeleteSuccess },
-        ["/api/commons/allplus"]
+        []
     );
 
killedBy: UserTable tests the correct parameters are passed to useBackendMutation when Delete is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [Function cellToAxiosParamsDelete], {"onSuccess": [Function onDeleteSuccess]}, ["/api/commons/allplus"]
Received
       1
          [Function cellToAxiosParamsDelete],
          {"onSuccess": [Function onDeleteSuccess]},
        - Array [

[Killed] BlockStatement
main/components/Commons/CommonsTable.js:22:44
         ["/api/commons/allplus"]
     );
 
-    const deleteCallback = async (cell) => { 
-        deleteMutation.mutate(cell); 
-    }
+    const deleteCallback = async (cell) => {}
 
     const leaderboardCallback = (cell) => {
killedBy: AdminListCommonPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Commons with id 1 was deleted"

Number of calls: 0

<html>
  <head />

[Killed] BlockStatement
main/components/Commons/CommonsTable.js:26:43
         deleteMutation.mutate(cell); 
     }
 
-    const leaderboardCallback = (cell) => {
-        navigate(`/leaderboard/${cell.row.values["commons.id"]}`)
-    }
+    const leaderboardCallback = (cell) => {}
 
     const columns = [
killedBy: AdminListCommonPage tests what happens when you click leaderboard as an admin
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/leaderboard/1"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:27:50
     }
 
     const leaderboardCallback = (cell) => {
-        navigate(`/leaderboard/${cell.row.values["commons.id"]}`)
+        navigate(`/leaderboard/${cell.row.values[""]}`)
     }
 
killedBy: AdminListCommonPage tests what happens when you click leaderboard as an admin
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/leaderboard/1"
Received: "/leaderboard/undefined"

Number of calls: 1

<html>

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:27:18
     }
 
     const leaderboardCallback = (cell) => {
-        navigate(`/leaderboard/${cell.row.values["commons.id"]}`)
+        navigate(``)
     }
 
killedBy: AdminListCommonPage tests what happens when you click leaderboard as an admin
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/leaderboard/1"
Received: ""

Number of calls: 1

<html>

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:38:23
         },
         {
             Header:'Name',
-            accessor: 'commons.name',
+            accessor: "",
         },
         {
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CommonsTable-cell-row-0-col-commons.name"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] ObjectLiteral
main/components/Commons/CommonsTable.js:50:9
             accessor: row => row.commons.milkPrice,
             id: 'commons.milkPrice'
         },
-        {
-            Header:'Starting Balance',
-            accessor: row => row.commons.startingBalance,
-            id: 'commons.startingBalance'
-        },
+        {},
         {
             Header:'Starting Date',
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:51:20
             id: 'commons.milkPrice'
         },
         {
-            Header:'Starting Balance',
+            Header:"",
             accessor: row => row.commons.startingBalance,
             id: 'commons.startingBalance'
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: Starting Balance. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display:

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:53:17
         {
             Header:'Starting Balance',
             accessor: row => row.commons.startingBalance,
-            id: 'commons.startingBalance'
+            id: ""
         },
         {
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CommonsTable-cell-row-0-col-commons.startingBalance"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:86:23
         },
         {
             Header: 'Effective Capacity',
-            accessor: row => row.commons.effectiveCapacity,
+            accessor: () => undefined,
             id: 'commons.effectiveCapacity'
         }
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  42
Received:

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:87:17
         {
             Header: 'Effective Capacity',
             accessor: row => row.commons.effectiveCapacity,
-            id: 'commons.effectiveCapacity'
+            id: ""
         }
     ];
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CommonsTable-cell-row-1-col-commons.effectiveCapacity"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:98:1
         ButtonColumn("Edit",
 "primary", editCallback, testid),
         ButtonColumn("Delete",
-"danger", deleteCallback, testid),
+"", deleteCallback, testid),
         ButtonColumn("Leaderboard",
 "secondary", leaderboardCallback, testid)
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  btn
