[Killed] MethodExpression
main/components/Commons/CommonsForm.js:30:19
 
     const curr = new Date();
     // eslint-disable-next-line no-unused-vars
-    const today = curr.toISOString().substr(0, 10);
+    const today = curr.toISOString();
     const DefaultVals = {
         name: "", startingBalance: "10000", cowPrice: "100",
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(2023-08-24)

Expected the element to have value:
  2023-08-24
Received:

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:37:68
     };
 
     const belowStrategy = initialCommons?.belowCapacityStrategy || healthUpdateStrategies?.defaultBelowCapacity;
-    const aboveStrategy = initialCommons?.aboveCapacityStrategy || healthUpdateStrategies?.defaultAboveCapacity;
+    const aboveStrategy = initialCommons?.aboveCapacityStrategy || healthUpdateStrategies.defaultAboveCapacity;
 
 
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'defaultAboveCapacity')
