[Killed] BlockStatement
main/components/Commons/CommonsSelect.js:3:100
 import {Form} from "react-bootstrap";
 
-function CommonsSelect({commons, handleCommonsSelection, selectedCommons, testid="CommonsSelect"}) {
-  return (
-    <Form.Group className="mb-3" >
-        <Form.Text htmlFor="commons" className="fw-bold fs-5">
-          Commons
-        </Form.Text>
-        <div className="ms-3" data-testid={`${testid}-CommonsSelect-div`}>
-          {commons.map((object) => (
-            <Form.Check
-              key={object.id}
-              type="radio"
-              label={object.name}
-              data-testid={`${testid}-commons-${object.id}`}
-              onChange={() => handleCommonsSelection(object.id, object.name)}
-              checked={selectedCommons === object.id}
-            />
-          ))}
-        </div>
-      </Form.Group>
-  );
-}
+function CommonsSelect({commons, handleCommonsSelection, selectedCommons, testid="CommonsSelect"}) {}
 
 export default CommonsSelect;
killedBy: SetCowHealthForm tests validates health > 0
statusReason: Error: CommonsSelect(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ConditionalExpression
main/components/Commons/CommonsSelect.js:17:24
               label={object.name}
               data-testid={`${testid}-commons-${object.id}`}
               onChange={() => handleCommonsSelection(object.id, object.name)}
-              checked={selectedCommons === object.id}
+              checked={false}
             />
           ))}
killedBy: SetCowHealthForm tests the first item in commons array is selected by default
statusReason: Error: expect(element).toHaveAttribute("checked", "") // element.getAttribute("checked") === ""

Expected the element to have attribute:
  checked=""
Received:
  null
