[Killed] LogicalOperator
main/components/Commons/HealthStrategiesUpdateDropdown.js:13:10
     return (
       <Form.Group className="mb-3">
         <Form.Label htmlFor={formName}>{displayName}</Form.Label>
-        {healthUpdateStrategies && (
-          <Form.Select
-            data-testid={`${formName}-select`}
-            id={formName}
-            // "required" option is not necessary, since dropdown will always have a value
-            {...register(formName)}
-            defaultValue={initialValue}
-          >
-            {healthUpdateStrategies.strategies.map((strategy) => (
-              <option 
-                key={strategy.name} 
-                value={strategy.name} 
-                title={strategy.description}
-                data-testid={formName + "-" + strategy.name}
-                >
-                {strategy.displayName}
-              </option>
-            ))}
-          </Form.Select>
-        )}
+        {healthUpdateStrategies || <Form.Select data-testid={`${formName}-select`} id={formName}
+// "required" option is not necessary, since dropdown will always have a value
+{...register(formName)} defaultValue={initialValue}>
+            {healthUpdateStrategies.strategies.map(strategy => <option key={strategy.name} value={strategy.name} title={strategy.description} data-testid={formName + "-" + strategy.name}>
+                {strategy.displayName}
+              </option>)}
+          </Form.Select>}
   
       </Form.Group>
killedBy: HealthUpdateStrategiesDropdown tests renders correctly, with initial value strat1
statusReason: Error: Objects are not valid as a React child (found: object with keys {strategies, defaultAboveCapacity, defaultBelowCapacity}). If you meant to render a collection of children, use an array instead.
