[Killed] BlockStatement
main/components/Jobs/InstructorReportForm.js:4:49
 import { Button, Form } from "react-bootstrap";
 import { useForm } from "react-hook-form";
 
-function InstructorReportForm( {submitAction} ) {
-  const {
-    handleSubmit,
-  } = useForm(
-  );
-
-  return (
-    <Form onSubmit={handleSubmit(submitAction)}>
-      <p>Click this button to generate an instructor report!</p>
-      <Button type="submit" data-testid="InstructorReport-Submit-Button">Generate</Button>
-    </Form>
-  );
-}
+function InstructorReportForm( {submitAction} ) {}
 export default InstructorReportForm;
 
killedBy: AdminJobsPage tests renders without crashing
statusReason: Error: InstructorReportForm(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
