[Killed] ConditionalExpression
main/components/Jobs/SetCowHealthForm.js:10:50
 function SetCowHealthForm({ submitAction=()=>{}, testid = "SetCowHealthForm" }) {
 
   const localHealthValue = localStorage.getItem(`${testid}-health`);
-  const [healthValue, setHealthValue] = useState(localHealthValue || 100);
+  const [healthValue, setHealthValue] = useState(true);
 
   const { data: commons } = useBackend(
killedBy: SetCowHealthForm tests validates health > 0
statusReason: Error: expect(element).toHaveValue(100)

Expected the element to have value:
  100
Received:
  null

[Killed] ObjectLiteral
main/components/Jobs/SetCowHealthForm.js:14:5
 
   const { data: commons } = useBackend(
     ["/api/commons/all"],
-    { url: "/api/commons/all" },
+    {},
     []
   );
killedBy: SetCowHealthForm tests validates health > 0
statusReason: Error: Unable to find an element by: [data-testid="SetCowHealthForm-healthValue"]

<body>
  <div>
    <div>
      There are no commons on which to run this job.
    </div>
  </div>

[Killed] StringLiteral
main/components/Jobs/SetCowHealthForm.js:72:23
           value={healthValue}
           {...register("healthValue", {
             valueAsNumber: true,
-            required: "Health Value is required",
+            required: "",
             min: { value: 0, message: "Health Value must be ≥ 0" },
             max: { value: 100, message: "Health Value must be ≤ 100" },
killedBy: SetCowHealthForm tests validates health is required
statusReason: Error: Unable to find an element with the text: /Health Value is required/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Jobs/SetCowHealthForm.js:73:18
           {...register("healthValue", {
             valueAsNumber: true,
             required: "Health Value is required",
-            min: { value: 0, message: "Health Value must be ≥ 0" },
+            min: {},
             max: { value: 100, message: "Health Value must be ≤ 100" },
           })}
killedBy: SetCowHealthForm tests validates health > 0
statusReason: Error: Unable to find an element with the text: /Health Value must be ≥ 0/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
