[Killed] ConditionalExpression
main/components/Chat/ChatDisplay.js:45:22
       
     // Stryker restore all
 
-    const messages = messagesProp || messagesData.content;
+    const messages = true;
     const userCommonsList = userCommonsListProp || userCommonsListData;
   
killedBy: ChatDisplay tests displays one message correctly with username
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 1
Received:    0

<html>
  <head />
  <body>

[Killed] ConditionalExpression
main/components/Chat/ChatDisplay.js:45:22
       
     // Stryker restore all
 
-    const messages = messagesProp || messagesData.content;
+    const messages = false;
     const userCommonsList = userCommonsListProp || userCommonsListData;
   
killedBy: ChatDisplay tests displays one message correctly with username
statusReason: Error: Unable to find an element by: [data-testid="ChatMessageDisplay-1"]

<body>
  <div>
    <div
      data-testid="ChatDisplay"
      style="display: flex; flex-direction: column-reverse; overflow-y: scroll; max-height: 300px;"
    />

[Killed] LogicalOperator
main/components/Chat/ChatDisplay.js:46:29
     // Stryker restore all
 
     const messages = messagesProp || messagesData.content;
-    const userCommonsList = userCommonsListProp || userCommonsListData;
+    const userCommonsList = userCommonsListProp && userCommonsListData;
   
     const sortedMessages = Array.isArray(messages) && messages.sort((a, b) => b.id - a.id);
killedBy: ChatDisplay tests displays one message correctly with username
statusReason: TestingLibraryElementError: Unable to find an element with the text: George Washington (1). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      data-testid="ChatDisplay"
      style="display: flex; flex-direction: column-reverse; overflow-y: scroll; max-he

[Killed] ConditionalExpression
main/components/Chat/ChatDisplay.js:46:29
     // Stryker restore all
 
     const messages = messagesProp || messagesData.content;
-    const userCommonsList = userCommonsListProp || userCommonsListData;
+    const userCommonsList = true;
   
     const sortedMessages = Array.isArray(messages) && messages.sort((a, b) => b.id - a.id);
killedBy: ChatDisplay tests displays one message correctly with username
statusReason: TestingLibraryElementError: Unable to find an element with the text: George Washington (1). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      data-testid="ChatDisplay"
      style="display: flex; flex-direction: column-reverse; overflow-y: scroll; max-he

[Killed] LogicalOperator
main/components/Chat/ChatDisplay.js:48:28
     const messages = messagesProp || messagesData.content;
     const userCommonsList = userCommonsListProp || userCommonsListData;
   
-    const sortedMessages = Array.isArray(messages) && messages.sort((a, b) => b.id - a.id);
+    const sortedMessages = Array.isArray(messages) || messages.sort((a, b) => b.id - a.id);
 
     const userIdToUsername = Array.isArray(userCommonsList)
killedBy: ChatDisplay tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'sort')

[Killed] ArithmeticOperator
main/components/Chat/ChatDisplay.js:48:79
     const messages = messagesProp || messagesData.content;
     const userCommonsList = userCommonsListProp || userCommonsListData;
   
-    const sortedMessages = Array.isArray(messages) && messages.sort((a, b) => b.id - a.id);
+    const sortedMessages = Array.isArray(messages) && messages.sort((a, b) => b.id + a.id);
 
     const userIdToUsername = Array.isArray(userCommonsList)
killedBy: ChatDisplay tests displays three messages correctly with usernames in the correct order
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ChatMessageDisplay-1"
Received: "ChatMessageDisplay-2"

<html>
  <head />
  <body>

[Killed] StringLiteral
main/components/Chat/ChatDisplay.js:58:82
     : {};
 
     return (
-      <div style={{ display: "flex", flexDirection: "column-reverse", overflowY: "scroll", maxHeight: "300px" }} data-testid="ChatDisplay" >
+      <div style={{ display: "flex", flexDirection: "column-reverse", overflowY: "", maxHeight: "300px" }} data-testid="ChatDisplay" >
         {Array.isArray(sortedMessages) && sortedMessages.slice(0, initialMessagePageSize).map((message) => (
             <ChatMessageDisplay 
killedBy: ChatDisplay tests renders without crashing
statusReason: Error: expect(element).toHaveStyle()

- Expected

- overflowY: scroll;

[Killed] StringLiteral
main/components/Chat/ChatDisplay.js:58:53
     : {};
 
     return (
-      <div style={{ display: "flex", flexDirection: "column-reverse", overflowY: "scroll", maxHeight: "300px" }} data-testid="ChatDisplay" >
+      <div style={{ display: "flex", flexDirection: "", overflowY: "scroll", maxHeight: "300px" }} data-testid="ChatDisplay" >
         {Array.isArray(sortedMessages) && sortedMessages.slice(0, initialMessagePageSize).map((message) => (
             <ChatMessageDisplay 
killedBy: ChatDisplay tests renders without crashing
statusReason: Error: expect(element).toHaveStyle()

- Expected

- flexDirection: column-reverse;

[Killed] ConditionalExpression
main/components/Chat/ChatDisplay.js:59:10
 
     return (
       <div style={{ display: "flex", flexDirection: "column-reverse", overflowY: "scroll", maxHeight: "300px" }} data-testid="ChatDisplay" >
-        {Array.isArray(sortedMessages) && sortedMessages.slice(0, initialMessagePageSize).map((message) => (
-            <ChatMessageDisplay 
-                key={message.id} 
-                message={{ ...message, username: userIdToUsername[message.userId] }} 
-                testId={`ChatMessageDisplay-${message.id}`}
-            />
-        ))}
+        {true}
       </div>
     );
killedBy: ChatDisplay tests displays one message correctly with username
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 1
Received:    0

<html>
  <head />
  <body>

[Killed] ArrowFunction
main/components/Chat/ChatDisplay.js:59:95
 
     return (
       <div style={{ display: "flex", flexDirection: "column-reverse", overflowY: "scroll", maxHeight: "300px" }} data-testid="ChatDisplay" >
-        {Array.isArray(sortedMessages) && sortedMessages.slice(0, initialMessagePageSize).map((message) => (
-            <ChatMessageDisplay 
-                key={message.id} 
-                message={{ ...message, username: userIdToUsername[message.userId] }} 
-                testId={`ChatMessageDisplay-${message.id}`}
-            />
-        ))}
+        {Array.isArray(sortedMessages) && sortedMessages.slice(0, initialMessagePageSize).map(() => undefined)}
       </div>
     );
killedBy: ChatPanel renders messages from fixtures
statusReason: Error: Unable to find an element with the text: George Washington (1). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="vstack gap-2"
      data-testid="ChatPanel"
      style="background-color: white;"
