[Killed] ArrowFunction
main/components/Chat/ChatMessageCreate.js:12:33
     const testid = "ChatMessageCreate";
     const initialMessagePageSize = 10;
 
-    const objectToAxiosParams = (newMessage) => ({
-        // Stryker disable next-line all : axiosMock post test works when mutated
-        url: `/api/chat/post?commonsId=${newMessage.commonsId}&content=${newMessage.content}`,
-        method: "POST",
-        data: newMessage
-    });
+    const objectToAxiosParams = () => undefined;
    
     const mutation = useBackendMutation(
killedBy: ChatMessageCreate When you fill in the message form and click submit, the right things happen
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] LogicalOperator
main/components/Chat/ChatMessageCreate.js:26:26
         [`/api/chat/get?page=0&size=${initialMessagePageSize}&commonsId=${commonsId}`]
     );
 
-    const submitAction = submitProp || (async (data) => {
-        const escapedContent = encodeURIComponent(data.message);
-        const escapedCommonsId = encodeURIComponent(Number(commonsId));
-        const params = { content: escapedContent, commonsId: escapedCommonsId };
-        mutation.mutate(params);
-        reset();
-    });
+    const submitAction = submitProp && (async data => {
+  const escapedContent = encodeURIComponent(data.message);
+  const escapedCommonsId = encodeURIComponent(Number(commonsId));
+  const params = {
+    content: escapedContent,
+    commonsId: escapedCommonsId
+  };
+  mutation.mutate(params);
+  reset();
+});
 
     const {
killedBy: ChatMessageCreate calls the correct submit action on successful submission
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/components/Chat/ChatMessageCreate.js:26:57
         [`/api/chat/get?page=0&size=${initialMessagePageSize}&commonsId=${commonsId}`]
     );
 
-    const submitAction = submitProp || (async (data) => {
-        const escapedContent = encodeURIComponent(data.message);
-        const escapedCommonsId = encodeURIComponent(Number(commonsId));
-        const params = { content: escapedContent, commonsId: escapedCommonsId };
-        mutation.mutate(params);
-        reset();
-    });
+    const submitAction = submitProp || (async (data) => {});
 
     const {
killedBy: ChatMessageCreate When you fill in the message form and click submit, the right things happen
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/components/Chat/ChatMessageCreate.js:43:20
 
     return (
         <Form data-testid={testid} onSubmit={handleSubmit(submitAction)} 
-            style={{ display: 'flex', justifyContent: 'space-between', alignItems: 'center' }}>
+            style={{}}>
             <Form.Control
                 data-testid={`${testid}-Message`}
killedBy: ChatMessageCreate renders without crashing
statusReason: Error: expect(element).toHaveStyle()

- Expected

- display: flex;
+ display: block;

[Killed] StringLiteral
main/components/Chat/ChatMessageCreate.js:43:31
 
     return (
         <Form data-testid={testid} onSubmit={handleSubmit(submitAction)} 
-            style={{ display: 'flex', justifyContent: 'space-between', alignItems: 'center' }}>
+            style={{ display: "", justifyContent: 'space-between', alignItems: 'center' }}>
             <Form.Control
                 data-testid={`${testid}-Message`}
killedBy: ChatMessageCreate renders without crashing
statusReason: Error: expect(element).toHaveStyle()

- Expected

- display: flex;
+ display: block;

[Killed] StringLiteral
main/components/Chat/ChatMessageCreate.js:45:30
         <Form data-testid={testid} onSubmit={handleSubmit(submitAction)} 
             style={{ display: 'flex', justifyContent: 'space-between', alignItems: 'center' }}>
             <Form.Control
-                data-testid={`${testid}-Message`}
+                data-testid={``}
                 id="message"
                 type="text"
killedBy: ChatMessageCreate renders without crashing
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ChatMessageCreate-Message"]

<body>
  <div>
    <form
      class=""
      data-testid="ChatMessageCreate"
      style="display: flex; justify-content: space-between; align-items: center;"

[Killed] StringLiteral
main/components/Chat/ChatMessageCreate.js:48:30
                 data-testid={`${testid}-Message`}
                 id="message"
                 type="text"
-                {...register("message", { required: "Message cannot be empty" })}
+                {...register("", { required: "Message cannot be empty" })}
             />
             <Form.Control.Feedback type="invalid">
killedBy: ChatMessageCreate renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/Chat/ChatMessageCreate.js:48:53
                 data-testid={`${testid}-Message`}
                 id="message"
                 type="text"
-                {...register("message", { required: "Message cannot be empty" })}
+                {...register("message", { required: "" })}
             />
             <Form.Control.Feedback type="invalid">
killedBy: ChatMessageCreate shows an error when the message input is empty
statusReason: Error: Unable to find an element with the text: Message cannot be empty. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
      data-testid="ChatMessageCreate"
      style="display: flex; justify-content: space-between; align-items: center;"

[Killed] StringLiteral
main/components/Chat/ChatMessageCreate.js:53:48
             <Form.Control.Feedback type="invalid">
                 {errors.message?.message}
             </Form.Control.Feedback>
-            <Button type="submit" data-testid={`${testid}-Send`}>Send</Button>
+            <Button type="submit" data-testid={``}>Send</Button>
         </Form>
     );
killedBy: ChatMessageCreate renders without crashing
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ChatMessageCreate-Send"]

<body>
  <div>
    <form
      class=""
      data-testid="ChatMessageCreate"
      style="display: flex; justify-content: space-between; align-items: center;"
