[Killed] BlockStatement
main/components/Commons/CommonsPlay.js:4:54
 import React, {useEffect, useState} from "react";
 import greetingsList from "../../../assets/PlayGreetings.json"
 
-export default function CommonsPlay({ currentUser }) {
-  // Stryker disable  all 
-  const firstName = currentUser?.root ? currentUser?.root?.user?.givenName : "";
-
-  const [welcomeText, setWelcomeText]= useState("Welcome farmer");
-
-  useEffect(() => {
-    const numOfGreetings = greetingsList.length;
-    const randomGreeting = greetingsList[Math.floor(Math.random() * numOfGreetings)];
-    setWelcomeText(randomGreeting);
-  }, []);
-
-  // Stryker restore all
-
-  return (
-    <div data-testid="CommonsPlay">
-      <h1>
-      {welcomeText} {firstName}! 
-    </h1>
-    </div>
-  );
-};
+export default function CommonsPlay({ currentUser }) {};
killedBy: PlayPage tests renders without crashing
statusReason: Error: CommonsPlay(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
