[Killed] StringLiteral
src/main/pages/PlayPage.js:93:11
 
 
   const onSuccessSell = () => {
-    toast(`Cow sold!`);
+    toast(``);
   }
 
killedBy: PlayPage tests click buy and sell buttons
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Cow sold!"
Received: ""

Number of calls: 1

[Killed] BlockStatement
src/main/pages/PlayPage.js:123:34
 
   const [isChatOpen, setIsChatOpen] = useState(false);
 
-  const toggleChatWindow = () => {
-    setIsChatOpen(!isChatOpen);
-  };
+  const toggleChatWindow = () => {};
 
   const chatButtonStyle = {
killedBy: PlayPage tests Chat toggle button opens and closes the ChatPanel
statusReason: Error: Unable to find an element by: [data-testid="ChatPanel"]

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.png);"
    >

[Killed] BooleanLiteral
src/main/pages/PlayPage.js:124:19
   const [isChatOpen, setIsChatOpen] = useState(false);
 
   const toggleChatWindow = () => {
-    setIsChatOpen(!isChatOpen);
+    setIsChatOpen(isChatOpen);
   };
 
killedBy: PlayPage tests Chat toggle button opens and closes the ChatPanel
statusReason: Error: Unable to find an element by: [data-testid="ChatPanel"]

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.png);"
    >

[Killed] StringLiteral
src/main/pages/PlayPage.js:130:19
   const chatButtonStyle = {
     width: '40px',
     height: '40px',
-    borderRadius: '50%',
+    borderRadius: "",
     backgroundColor: 'lightblue',
     color: 'black',
killedBy: PlayPage tests Chat button and container have correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

  background-color: lightblue;
- border-radius: 50%;
  bottom: 20px;
  color: black;

[Killed] ObjectLiteral
src/main/pages/PlayPage.js:138:30
     right: '20px',
   };
 
-  const chatContainerStyle = {
-    width: '550px',
-    position: 'fixed',
-    bottom: '100px',
-    right: '20px',
-  };
+  const chatContainerStyle = {};
 
   return (
killedBy: PlayPage tests Chat button and container have correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

- bottom: 100px;
- position: fixed;
- right: 20px;
- width: 550px;

[Killed] StringLiteral
src/main/pages/PlayPage.js:140:15
 
   const chatContainerStyle = {
     width: '550px',
-    position: 'fixed',
+    position: "",
     bottom: '100px',
     right: '20px',
killedBy: PlayPage tests Chat button and container have correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

  bottom: 100px;
- position: fixed;
  right: 20px;
  width: 550px;

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:150:12
       <BasicLayout >
         <Container >
           {!!currentUser && <CommonsPlay currentUser={currentUser} />}
-          {!!commonsPlus && <CommonsOverview commonsPlus={commonsPlus} currentUser={currentUser} />}
+          {true}
           <br />
           {!!userCommons && !!commonsPlus &&
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Error: Unable to find an element with the text: /Announcements/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.png);"
    >

[Killed] LogicalOperator
src/main/pages/PlayPage.js:152:12
           {!!currentUser && <CommonsPlay currentUser={currentUser} />}
           {!!commonsPlus && <CommonsOverview commonsPlus={commonsPlus} currentUser={currentUser} />}
           <br />
-          {!!userCommons && !!commonsPlus &&
-            <CardGroup >
-              <ManageCows userCommons={userCommons} commons={commonsPlus.commons} onBuy={onBuy} onSell={onSell} />
-              <FarmStats userCommons={userCommons} />
-              <Profits userCommons={userCommons} profits={userCommonsProfits} />
-            </CardGroup>
+          {!!userCommons && !!commonsPlus || <CardGroup>
+              <ManageCows userCommons={userCommons} commons={commonsPlus.commons} onBuy={onBuy} onSell={onSell} />
+              <FarmStats userCommons={userCommons} />
+              <Profits userCommons={userCommons} profits={userCommonsProfits} />
+            </CardGroup>
           }
         </Container>
killedBy: PlayPage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'commons')

[Killed] BooleanLiteral
src/main/pages/PlayPage.js:164:13
       <div style={chatContainerStyle} data-testid="playpage-chat-div">
         {!!isChatOpen && <ChatPanel commonsId={commonsId}/>}
         <Button style={chatButtonStyle} onClick={toggleChatWindow} data-testid="playpage-chat-toggle">
-          {!!isChatOpen ? '▼' : '▲'}
+          {!isChatOpen ? '▼' : '▲'}
         </Button>
       </div>
killedBy: PlayPage tests Chat button and container have correct styles
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  ▲
Received:
  ▼
