[Killed] BlockStatement
main/components/Chat/ChatPanel.js:6:92
 import ChatMessageCreate from 'main/components/Chat/ChatMessageCreate';
 import ChatDisplay from 'main/components/Chat/ChatDisplay';
 
-const ChatPanel = ({ commonsId, messages: messagesProp, userCommons: userCommonsProp }) => {
-  return (
-    <Stack gap={2} style={{ backgroundColor: 'white' }} data-testid="ChatPanel" > 
-      <ChatDisplay commonsId={commonsId} messages={messagesProp} userCommons={userCommonsProp} />
-      <ChatMessageCreate commonsId={commonsId} />
-    </Stack>
-  );
-};
+const ChatPanel = ({ commonsId, messages: messagesProp, userCommons: userCommonsProp }) => {};
 
 export default ChatPanel;
killedBy: PlayPage tests Chat toggle button opens and closes the ChatPanel
statusReason: Error: ChatPanel(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
