[Killed] ArrowFunction
main/components/Commons/PagedProfitsTable.js:71:51
                 <div data-testid="PageNavBottom" className="d-flex justify-content-center">
                     <Pagination >
                         <Pagination.First onClick={() => onPageChange(0)} data-testid="PageNavBottom-btn-first"/>
-                        <Pagination.Prev onClick={() => onPageChange(pageable.pageNumber - 1)} data-testid="PageNavBottom-btn-prev"/>
+                        <Pagination.Prev onClick={() => undefined} data-testid="PageNavBottom-btn-prev"/>
 
                         {/* Loop through the nearby pages */}
killedBy: PlayPage tests User can navigate the profit table
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  $12.650
Received:
  $2.300

<html>

[Killed] ArithmeticOperator
main/components/Commons/PagedProfitsTable.js:71:70
                 <div data-testid="PageNavBottom" className="d-flex justify-content-center">
                     <Pagination >
                         <Pagination.First onClick={() => onPageChange(0)} data-testid="PageNavBottom-btn-first"/>
-                        <Pagination.Prev onClick={() => onPageChange(pageable.pageNumber - 1)} data-testid="PageNavBottom-btn-prev"/>
+                        <Pagination.Prev onClick={() => onPageChange(pageable.pageNumber + 1)} data-testid="PageNavBottom-btn-prev"/>
 
                         {/* Loop through the nearby pages */}
killedBy: PlayPage tests User can navigate the profit table
statusReason: Error: Request failed with status code 404

[Killed] ConditionalExpression
main/components/Commons/PagedProfitsTable.js:76:33
                         {/* Loop through the nearby pages */}
                         {Array.from({ length: totalPages }, (_, index) => {
                             if (
-                                index >= pageable.pageNumber - 1 &&
-                                index <= pageable.pageNumber + 1
+                                true
                             ) {
                                 return (
killedBy: Paged Profit Table tests First Page and basic components are rendered as expected
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a class="page-link" data-testid="PageNavBottom-btn-item-2" href="#" role="button" tabindex="0">3</a> instead

[Killed] ArithmeticOperator
main/components/Commons/PagedProfitsTable.js:77:42
                         {Array.from({ length: totalPages }, (_, index) => {
                             if (
                                 index >= pageable.pageNumber - 1 &&
-                                index <= pageable.pageNumber + 1
+                                index <= pageable.pageNumber - 1
                             ) {
                                 return (
killedBy: PlayPage tests User can navigate the profit table
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="PageNavBottom-btn-item-1"]

<body>
  <div>
    <div
      data-testid="playpage-div"
    >
      <div

[Killed] ArrowFunction
main/components/Commons/PagedProfitsTable.js:94:51
                             return null;
                         })}
 
-                        <Pagination.Next onClick={() => onPageChange(pageable.pageNumber + 1)} data-testid="PageNavBottom-btn-next"/>
+                        <Pagination.Next onClick={() => undefined} data-testid="PageNavBottom-btn-next"/>
                         <Pagination.Last onClick={() => onPageChange(totalPages - 1)} data-testid="PageNavBottom-btn-last" />
                     </Pagination>
killedBy: PlayPage tests User can navigate the profit table
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  $2.300
Received:
  $12.650

<html>

[Killed] ArithmeticOperator
main/components/Commons/PagedProfitsTable.js:94:70
                             return null;
                         })}
 
-                        <Pagination.Next onClick={() => onPageChange(pageable.pageNumber + 1)} data-testid="PageNavBottom-btn-next"/>
+                        <Pagination.Next onClick={() => onPageChange(pageable.pageNumber - 1)} data-testid="PageNavBottom-btn-next"/>
                         <Pagination.Last onClick={() => onPageChange(totalPages - 1)} data-testid="PageNavBottom-btn-last" />
                     </Pagination>
killedBy: PlayPage tests User can navigate the profit table
statusReason: Error: Request failed with status code 404

[Killed] ArrowFunction
main/components/Commons/PagedProfitsTable.js:95:51
                         })}
 
                         <Pagination.Next onClick={() => onPageChange(pageable.pageNumber + 1)} data-testid="PageNavBottom-btn-next"/>
-                        <Pagination.Last onClick={() => onPageChange(totalPages - 1)} data-testid="PageNavBottom-btn-last" />
+                        <Pagination.Last onClick={() => undefined} data-testid="PageNavBottom-btn-last" />
                     </Pagination>
                 </div>
killedBy: PlayPage tests User can navigate the profit table
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  $3.450
Received:
  $12.650

<html>

[Killed] ArithmeticOperator
main/components/Commons/PagedProfitsTable.js:95:70
                         })}
 
                         <Pagination.Next onClick={() => onPageChange(pageable.pageNumber + 1)} data-testid="PageNavBottom-btn-next"/>
-                        <Pagination.Last onClick={() => onPageChange(totalPages - 1)} data-testid="PageNavBottom-btn-last" />
+                        <Pagination.Last onClick={() => onPageChange(totalPages + 1)} data-testid="PageNavBottom-btn-last" />
                     </Pagination>
                 </div>
killedBy: PlayPage tests User can navigate the profit table
statusReason: Error: Request failed with status code 404
