[Killed] ObjectLiteral
src/main/pages/PlayPage.js:32:15
     // useEffect(() => {FetchData();}, []);
 
     useEffect(() => {
-        axios({
-            // Stryker disable next-line all:"GET" replace by "" still calls GET method
-            method: "GET",
-            url: `/api/profits/paged/commonsid?commonsId=${commonsId}&pageNumber=${currentPage}&pageSize=${userQueryPageSize}`,
-        }).then(response => {
+        axios({}).then(response => {
             setpageddata(response.data);
         })
killedBy: PlayPage tests buy and sell buttons behave as expected
statusReason: Error: Request failed with status code 404

[Killed] BlockStatement
src/main/pages/PlayPage.js:36:29
             // Stryker disable next-line all:"GET" replace by "" still calls GET method
             method: "GET",
             url: `/api/profits/paged/commonsid?commonsId=${commonsId}&pageNumber=${currentPage}&pageSize=${userQueryPageSize}`,
-        }).then(response => {
-            setpageddata(response.data);
-        })
+        }).then(response => {})
     }, [currentPage, commonsId, userQueryPageSize]);
 
killedBy: PlayPage tests should fetch data when mounted
statusReason: Error: Unable to find an element by: [data-testid="ProfitsTable-cell-row-0-col-Profit"]

<body>
  <div>
    <div
      data-testid="playpage-div"
    >
      <div

[Killed] ArrayDeclaration
src/main/pages/PlayPage.js:39:8
         }).then(response => {
             setpageddata(response.data);
         })
-    }, [currentPage, commonsId, userQueryPageSize]);
+    }, []);
 
     const handlePageChange = (newPage) => {
killedBy: PlayPage tests User can navigate the profit table
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  $3.450
Received:
  $12.650

<html>

[Killed] BlockStatement
src/main/pages/PlayPage.js:41:43
         })
     }, [currentPage, commonsId, userQueryPageSize]);
 
-    const handlePageChange = (newPage) => {
-        setCurrentPage(newPage);
-        axios({
-            // Stryker disable next-line all:"GET" replace by "" still calls GET method
-            method: "GET",
-            url: `/api/profits/paged/commonsid?commonsId=${commonsId}&pageNumber=${currentPage}&pageSize=${userQueryPageSize}`,
-        }).then(response => {
-            setpageddata(response.data);
-        })
-    };
+    const handlePageChange = (newPage) => {};
 
   // Stryker disable all 
killedBy: PlayPage tests User can navigate the profit table
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  $3.450
Received:
  $12.650

<html>

[Killed] LogicalOperator
src/main/pages/PlayPage.js:144:12
           {!!currentUser && <CommonsPlay currentUser={currentUser} />}
           {!!commonsPlus && <CommonsOverview commonsPlus={commonsPlus} currentUser={currentUser} />}
           <br />
-          {!!userCommons && !!commonsPlus &&
-            <CardGroup >
-              <ManageCows userCommons={userCommons} commons={commonsPlus.commons} onBuy={onBuy} onSell={onSell} />
-              <FarmStats userCommons={userCommons} />
-              <PagedProfitsTable data={pageddata} onPageChange={handlePageChange} />
-            </CardGroup>
+          {!!userCommons && !!commonsPlus || <CardGroup>
+              <ManageCows userCommons={userCommons} commons={commonsPlus.commons} onBuy={onBuy} onSell={onSell} />
+              <FarmStats userCommons={userCommons} />
+              <PagedProfitsTable data={pageddata} onPageChange={handlePageChange} />
+            </CardGroup>
           }
         </Container>
killedBy: PlayPage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'commons')
