[Killed] BlockStatement
main/components/Commons/PagedProfitsTable.js:13:49
     //eslint-disable-next-line no-unused-vars
     const {content, pageable, _, totalPages} = data;
 
-    const profitsForTable = React.useMemo(() => {
-        return content
-            ? content.map(item => ({
-                date: timestampToDate(item.timestamp),
-                ...item
-            }))
-            // Stryker disable next-line ArrayDeclaration : no need to test what happens if [] is replaced with ["Stryker was here"]
-            : [];
-    }, [content]);
+    const profitsForTable = React.useMemo(() => {}, [content]);
 
     profitsForTable.reverse();
killedBy: PlayPage tests buy and sell buttons behave as expected
statusReason: TypeError: Cannot read properties of undefined (reading 'reverse')

[Killed] ArrowFunction
main/components/Commons/PagedProfitsTable.js:15:27
 
     const profitsForTable = React.useMemo(() => {
         return content
-            ? content.map(item => ({
-                date: timestampToDate(item.timestamp),
-                ...item
-            }))
+            ? content.map(() => undefined)
             // Stryker disable next-line ArrayDeclaration : no need to test what happens if [] is replaced with ["Stryker was here"]
             : [];
killedBy: Paged Profit Table tests First Page and basic components are rendered as expected
statusReason: TypeError: Cannot read properties of undefined (reading 'subRows')

[Killed] MethodExpression
main/components/Commons/PagedProfitsTable.js:23:5
             : [];
     }, [content]);
 
-    profitsForTable.reverse();
+    profitsForTable;
 
     // Stryker disable ArrayDeclaration : [columns] and [students] are performance optimization; mutation preserves correctness
killedBy: PlayPage tests should fetch data when mounted
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  $12.650
Received:
  $1.150K

[Killed] ArrowFunction
main/components/Commons/PagedProfitsTable.js:26:43
     profitsForTable.reverse();
 
     // Stryker disable ArrayDeclaration : [columns] and [students] are performance optimization; mutation preserves correctness
-    const memoizedColumns = React.useMemo(() =>
-            [
-                {
-                    Header: "Profit",
-                    accessor: (row) => `$${parseMoney(row.amount)}`,
-                },
-                {
-                    Header: "Date",
-                    accessor: "date",
-                },
-                {
-                    Header: "Health",
-                    accessor: (row) => `${row.avgCowHealth.toFixed(2) + '%'}`
-                },
-                {
-                    Header: "Cows",
-                    accessor: "numCows",
-                },
-            ],
+    const memoizedColumns = React.useMemo(() => undefined,
         []);
     const memoizedDates = React.useMemo(() => profitsForTable, [profitsForTable]);
killedBy: PlayPage tests buy and sell buttons behave as expected
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] ObjectLiteral
main/components/Commons/PagedProfitsTable.js:28:17
     // Stryker disable ArrayDeclaration : [columns] and [students] are performance optimization; mutation preserves correctness
     const memoizedColumns = React.useMemo(() =>
             [
-                {
-                    Header: "Profit",
-                    accessor: (row) => `$${parseMoney(row.amount)}`,
-                },
+                {},
                 {
                     Header: "Date",
killedBy: PlayPage tests buy and sell buttons behave as expected
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Commons/PagedProfitsTable.js:29:29
     const memoizedColumns = React.useMemo(() =>
             [
                 {
-                    Header: "Profit",
+                    Header: "",
                     accessor: (row) => `$${parseMoney(row.amount)}`,
                 },
killedBy: Paged Profit Table tests renders without crashing for empty profits
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Commons/PagedProfitsTable.js:30:31
             [
                 {
                     Header: "Profit",
-                    accessor: (row) => `$${parseMoney(row.amount)}`,
+                    accessor: () => undefined,
                 },
                 {
killedBy: PlayPage tests should fetch data when mounted
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  $12.650
Received:

[Killed] StringLiteral
main/components/Commons/PagedProfitsTable.js:30:40
             [
                 {
                     Header: "Profit",
-                    accessor: (row) => `$${parseMoney(row.amount)}`,
+                    accessor: (row) => ``,
                 },
                 {
killedBy: Paged Profit Table tests First Page and basic components are rendered as expected
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  $12.650
Received:


<html>

[Killed] ArrowFunction
main/components/Commons/PagedProfitsTable.js:38:31
                 },
                 {
                     Header: "Health",
-                    accessor: (row) => `${row.avgCowHealth.toFixed(2) + '%'}`
+                    accessor: () => undefined
                 },
                 {
killedBy: Paged Profit Table tests First Page and basic components are rendered as expected
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  1.10%
Received:

[Killed] StringLiteral
main/components/Commons/PagedProfitsTable.js:38:73
                 },
                 {
                     Header: "Health",
-                    accessor: (row) => `${row.avgCowHealth.toFixed(2) + '%'}`
+                    accessor: (row) => `${row.avgCowHealth.toFixed(2) + ""}`
                 },
                 {
killedBy: Paged Profit Table tests First Page and basic components are rendered as expected
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  1.10%
Received:
  1.10

[Killed] ArrowFunction
main/components/Commons/PagedProfitsTable.js:46:41
                 },
             ],
         []);
-    const memoizedDates = React.useMemo(() => profitsForTable, [profitsForTable]);
+    const memoizedDates = React.useMemo(() => undefined, [profitsForTable]);
     // Stryker restore ArrayDeclaration
 
killedBy: Paged Profit Table tests renders without crashing for empty profits
statusReason: TypeError: Cannot read properties of undefined (reading 'forEach')

[Killed] ArrowFunction
main/components/Commons/PagedProfitsTable.js:70:52
                 {/* Pagination component */}
                 <div data-testid="PageNavBottom" className="d-flex justify-content-center">
                     <Pagination>
-                        <Pagination.First onClick={() => onPageChange(0)} data-testid="PageNavBottom-btn-first"/>
+                        <Pagination.First onClick={() => undefined} data-testid="PageNavBottom-btn-first"/>
                         <Pagination.Prev onClick={() => onPageChange(pageable.pageNumber - 1)}
                                          data-testid="PageNavBottom-btn-prev"/>
killedBy: PlayPage tests User can navigate the profit table
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  $12.650
Received:
  $3.450

<html>

[Killed] ArrowFunction
main/components/Commons/PagedProfitsTable.js:71:51
                 <div data-testid="PageNavBottom" className="d-flex justify-content-center">
                     <Pagination>
                         <Pagination.First onClick={() => onPageChange(0)} data-testid="PageNavBottom-btn-first"/>
-                        <Pagination.Prev onClick={() => onPageChange(pageable.pageNumber - 1)}
+                        <Pagination.Prev onClick={() => undefined}
                                          data-testid="PageNavBottom-btn-prev"/>
 
killedBy: PlayPage tests User can navigate the profit table
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  $12.650
Received:
  $2.300

<html>

[Killed] ArithmeticOperator
main/components/Commons/PagedProfitsTable.js:71:70
                 <div data-testid="PageNavBottom" className="d-flex justify-content-center">
                     <Pagination>
                         <Pagination.First onClick={() => onPageChange(0)} data-testid="PageNavBottom-btn-first"/>
-                        <Pagination.Prev onClick={() => onPageChange(pageable.pageNumber - 1)}
+                        <Pagination.Prev onClick={() => onPageChange(pageable.pageNumber + 1)}
                                          data-testid="PageNavBottom-btn-prev"/>
 
killedBy: PlayPage tests User can navigate the profit table
statusReason: Error: Request failed with status code 404

[Killed] BlockStatement
main/components/Commons/PagedProfitsTable.js:75:73
                                          data-testid="PageNavBottom-btn-prev"/>
 
                         {/* Loop through the nearby pages */}
-                        {Array.from({length: totalPages}, (_, index) => {
-                            if (
-                                index >= pageable.pageNumber - 1 &&
-                                index <= pageable.pageNumber + 1
-                            ) {
-                                return (
-                                    <Pagination.Item
-                                        key={index}
-                                        // Stryker disable next-line all : hard to check parent attribute unless accessing DOM
-                                        active={index === pageable.pageNumber}
-                                        onClick={() => onPageChange(index)}
-                                        data-testid={`PageNavBottom-btn-item-${index}`}
-                                    >
-                                        {index + 1}
-                                    </Pagination.Item>
-                                );
-                            }
-                            return null;
-                        })}
+                        {Array.from({length: totalPages}, (_, index) => {})}
 
                         <Pagination.Next onClick={() => onPageChange(pageable.pageNumber + 1)}
killedBy: PlayPage tests User can navigate the profit table
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="PageNavBottom-btn-item-1"]

<body>
  <div>
    <div
      data-testid="playpage-div"
    >
      <div

[Killed] EqualityOperator
main/components/Commons/PagedProfitsTable.js:77:33
                         {/* Loop through the nearby pages */}
                         {Array.from({length: totalPages}, (_, index) => {
                             if (
-                                index >= pageable.pageNumber - 1 &&
+                                index < pageable.pageNumber - 1 &&
                                 index <= pageable.pageNumber + 1
                             ) {
killedBy: Paged Profit Table tests First Page and basic components are rendered as expected
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="PageNavBottom-btn-item-0"]

<body>
  <div>
    <div>
      <div
        class="card"
      >

[Killed] ConditionalExpression
main/components/Commons/PagedProfitsTable.js:77:33
                         {/* Loop through the nearby pages */}
                         {Array.from({length: totalPages}, (_, index) => {
                             if (
-                                index >= pageable.pageNumber - 1 &&
-                                index <= pageable.pageNumber + 1
+                                false
                             ) {
                                 return (
killedBy: PlayPage tests User can navigate the profit table
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="PageNavBottom-btn-item-1"]

<body>
  <div>
    <div
      data-testid="playpage-div"
    >
      <div

[Killed] ConditionalExpression
main/components/Commons/PagedProfitsTable.js:78:33
                         {Array.from({length: totalPages}, (_, index) => {
                             if (
                                 index >= pageable.pageNumber - 1 &&
-                                index <= pageable.pageNumber + 1
+                                true
                             ) {
                                 return (
killedBy: Paged Profit Table tests First Page and basic components are rendered as expected
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a class="page-link" data-testid="PageNavBottom-btn-item-2" href="#" role="button" tabindex="0">3</a> instead

[Killed] EqualityOperator
main/components/Commons/PagedProfitsTable.js:78:33
                         {Array.from({length: totalPages}, (_, index) => {
                             if (
                                 index >= pageable.pageNumber - 1 &&
-                                index <= pageable.pageNumber + 1
+                                index < pageable.pageNumber + 1
                             ) {
                                 return (
killedBy: PlayPage tests User can navigate the profit table
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="PageNavBottom-btn-item-1"]

<body>
  <div>
    <div
      data-testid="playpage-div"
    >
      <div

[Killed] BlockStatement
main/components/Commons/PagedProfitsTable.js:79:31
                             if (
                                 index >= pageable.pageNumber - 1 &&
                                 index <= pageable.pageNumber + 1
-                            ) {
-                                return (
-                                    <Pagination.Item
-                                        key={index}
-                                        // Stryker disable next-line all : hard to check parent attribute unless accessing DOM
-                                        active={index === pageable.pageNumber}
-                                        onClick={() => onPageChange(index)}
-                                        data-testid={`PageNavBottom-btn-item-${index}`}
-                                    >
-                                        {index + 1}
-                                    </Pagination.Item>
-                                );
-                            }
+                            ) {}
                             return null;
                         })}
killedBy: PlayPage tests User can navigate the profit table
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="PageNavBottom-btn-item-1"]

<body>
  <div>
    <div
      data-testid="playpage-div"
    >
      <div

[Killed] ArrowFunction
main/components/Commons/PagedProfitsTable.js:85:50
                                         key={index}
                                         // Stryker disable next-line all : hard to check parent attribute unless accessing DOM
                                         active={index === pageable.pageNumber}
-                                        onClick={() => onPageChange(index)}
+                                        onClick={() => undefined}
                                         data-testid={`PageNavBottom-btn-item-${index}`}
                                     >
killedBy: PlayPage tests User can navigate the profit table
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  $2.300
Received:
  $12.650

<html>

[Killed] ArrowFunction
main/components/Commons/PagedProfitsTable.js:95:51
                             return null;
                         })}
 
-                        <Pagination.Next onClick={() => onPageChange(pageable.pageNumber + 1)}
+                        <Pagination.Next onClick={() => undefined}
                                          data-testid="PageNavBottom-btn-next"/>
                         <Pagination.Last onClick={() => onPageChange(totalPages - 1)}
killedBy: PlayPage tests User can navigate the profit table
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  $2.300
Received:
  $12.650

<html>

[Killed] ArithmeticOperator
main/components/Commons/PagedProfitsTable.js:95:70
                             return null;
                         })}
 
-                        <Pagination.Next onClick={() => onPageChange(pageable.pageNumber + 1)}
+                        <Pagination.Next onClick={() => onPageChange(pageable.pageNumber - 1)}
                                          data-testid="PageNavBottom-btn-next"/>
                         <Pagination.Last onClick={() => onPageChange(totalPages - 1)}
killedBy: PlayPage tests User can navigate the profit table
statusReason: Error: Request failed with status code 404

[Killed] ArrowFunction
main/components/Commons/PagedProfitsTable.js:97:51
 
                         <Pagination.Next onClick={() => onPageChange(pageable.pageNumber + 1)}
                                          data-testid="PageNavBottom-btn-next"/>
-                        <Pagination.Last onClick={() => onPageChange(totalPages - 1)}
+                        <Pagination.Last onClick={() => undefined}
                                          data-testid="PageNavBottom-btn-last"/>
                     </Pagination>
killedBy: PlayPage tests User can navigate the profit table
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  $3.450
Received:
  $12.650

<html>

[Killed] ArithmeticOperator
main/components/Commons/PagedProfitsTable.js:97:70
 
                         <Pagination.Next onClick={() => onPageChange(pageable.pageNumber + 1)}
                                          data-testid="PageNavBottom-btn-next"/>
-                        <Pagination.Last onClick={() => onPageChange(totalPages - 1)}
+                        <Pagination.Last onClick={() => onPageChange(totalPages + 1)}
                                          data-testid="PageNavBottom-btn-last"/>
                     </Pagination>
killedBy: PlayPage tests User can navigate the profit table
statusReason: Error: Request failed with status code 404
