[Killed] ObjectLiteral
src/main/pages/LeaderboardPage.js:56:58
   const showLeaderboard = (hasRole(currentUser, "ROLE_ADMIN") || commons.showLeaderboard );
 
   return (
-    <div data-testid={"LeaderboardPage-main-div"} style={{backgroundSize: 'cover', backgroundImage: `url(${Background})`}}>
+    <div data-testid={"LeaderboardPage-main-div"} style={{}}>
         <BasicLayout>
             <div className="pt-2">
killedBy: LeaderboardPage tests renders without crashing for users
statusReason: Error: expect(element).toHaveAttribute("style", "background-size: cover; background-image: url(PlayPageBackground.png);") // element.getAttribute("style") === "background-size: cover; background-image: url(PlayPageBackground.png);"

Expected the element to have attribute:
  style="background-size: cover; background-image: url(PlayPageBackground.png);"
Received:
  null

[Killed] UnaryOperator
src/main/pages/LeaderboardPage.js:66:49
                   (<p>You're not authorized to see the leaderboard.</p>)
                 }
                 </div>
-                <Button onClick={() => navigate(-1)} data-testid="LeaderboardPage-back-button" >
+                <Button onClick={() => navigate(+1)} data-testid="LeaderboardPage-back-button" >
                     Back
                 </Button>
killedBy: LeaderboardPage tests that navigate(-1) is called when Back is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: -1
Received: 1

Number of calls: 1

<html>

[Killed] ArrowFunction
src/main/pages/LeaderboardPage.js:66:34
                   (<p>You're not authorized to see the leaderboard.</p>)
                 }
                 </div>
-                <Button onClick={() => navigate(-1)} data-testid="LeaderboardPage-back-button" >
+                <Button onClick={() => undefined} data-testid="LeaderboardPage-back-button" >
                     Back
                 </Button>
killedBy: LeaderboardPage tests that navigate(-1) is called when Back is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: -1

Number of calls: 0

<html>
  <head />
