[Killed] BlockStatement
src/main/pages/PlayPage.js:29:47
     const [pageddata, setpageddata] = useState([]);
 
 
-    const FetchData = React.useCallback(() => {
-        axios({
-            // Stryker disable next-line all:"GET" replace by "" still calls GET method
-            method: "GET",
-            url: `/api/profits/paged/commonsid?commonsId=${commonsId}&pageNumber=${currentPage}&pageSize=${userQueryPageSize}`,
-        }).then(response => {
-            setpageddata(response.data);
-        });
-    }, [commonsId, currentPage, userQueryPageSize]);
+    const FetchData = React.useCallback(() => {}, [commonsId, currentPage, userQueryPageSize]);
 
     useEffect(() => {
killedBy: PlayPage tests should fetch data when mounted
statusReason: Error: Unable to find an element by: [data-testid="ProfitsTable-cell-row-0-col-Profit"]

<body>
  <div>
    <div
      data-testid="playpage-div"
    >
      <div

[Killed] BlockStatement
src/main/pages/PlayPage.js:34:29
             // Stryker disable next-line all:"GET" replace by "" still calls GET method
             method: "GET",
             url: `/api/profits/paged/commonsid?commonsId=${commonsId}&pageNumber=${currentPage}&pageSize=${userQueryPageSize}`,
-        }).then(response => {
-            setpageddata(response.data);
-        });
+        }).then(response => {});
     }, [commonsId, currentPage, userQueryPageSize]);
 
killedBy: PlayPage tests should fetch data when mounted
statusReason: Error: Unable to find an element by: [data-testid="ProfitsTable-cell-row-0-col-Profit"]

<body>
  <div>
    <div
      data-testid="playpage-div"
    >
      <div

[Killed] ArrayDeclaration
src/main/pages/PlayPage.js:37:8
         }).then(response => {
             setpageddata(response.data);
         });
-    }, [commonsId, currentPage, userQueryPageSize]);
+    }, []);
 
     useEffect(() => {
killedBy: PlayPage tests User can navigate the profit table
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  $3.450
Received:
  $12.650

<html>

[Killed] BlockStatement
src/main/pages/PlayPage.js:39:21
         });
     }, [commonsId, currentPage, userQueryPageSize]);
 
-    useEffect(() => {
-        FetchData();
-    }, [FetchData]);
+    useEffect(() => {}, [FetchData]);
 
     const handlePageChange = React.useCallback(newPage => {
killedBy: PlayPage tests should fetch data when mounted
statusReason: Error: Unable to find an element by: [data-testid="ProfitsTable-cell-row-0-col-Profit"]

<body>
  <div>
    <div
      data-testid="playpage-div"
    >
      <div

[Killed] BlockStatement
src/main/pages/PlayPage.js:43:59
         FetchData();
     }, [FetchData]);
 
-    const handlePageChange = React.useCallback(newPage => {
-            setCurrentPage(newPage);
-            FetchData();
-        },
+    const handlePageChange = React.useCallback(newPage => {},
         // Stryker disable next-line ArrayDeclaration : no need to test what happens if [] is replaced with ["Stryker was here"]
         [FetchData]);
killedBy: PlayPage tests User can navigate the profit table
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  $3.450
Received:
  $12.650

<html>

[Killed] BooleanLiteral
src/main/pages/PlayPage.js:141:22
             <BasicLayout>
                 <Container>
                     {!!currentUser && <CommonsPlay currentUser={currentUser}/>}
-                    {!!commonsPlus && <CommonsOverview commonsPlus={commonsPlus} currentUser={currentUser}/>}
+                    {!commonsPlus && <CommonsOverview commonsPlus={commonsPlus} currentUser={currentUser}/>}
                     <br/>
                     {!!userCommons && !!commonsPlus &&
killedBy: PlayPage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'commons')
