[Killed] BlockStatement
main/components/Commons/CommonsOverview.js:11:42
 export default function CommonsOverview({ commonsPlus, currentUser }) {
 
     let navigate = useNavigate();
-    const leaderboardButtonClick = () => {
-        if (currentUser) {navigate("/leaderboard/" + commonsPlus.commons.id);} else {
-            // Display a toast message indicating the user should log in
-            toast("Please log in before trying the leaderboard feature");
-        }
-    };
+    const leaderboardButtonClick = () => {};
     const showLeaderboard = (hasRole(currentUser, "ROLE_ADMIN") || commonsPlus.commons.showLeaderboard );
     return (
killedBy: CommonsOverview tests Popping out toast messages for visitor
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Please log in before trying the leaderboard feature"

Number of calls: 0

[Killed] BlockStatement
main/components/Commons/CommonsOverview.js:12:85
 
     let navigate = useNavigate();
     const leaderboardButtonClick = () => {
-        if (currentUser) {navigate("/leaderboard/" + commonsPlus.commons.id);} else {
-            // Display a toast message indicating the user should log in
-            toast("Please log in before trying the leaderboard feature");
-        }
+        if (currentUser) {navigate("/leaderboard/" + commonsPlus.commons.id);} else {}
     };
     const showLeaderboard = (hasRole(currentUser, "ROLE_ADMIN") || commonsPlus.commons.showLeaderboard );
killedBy: CommonsOverview tests Popping out toast messages for visitor
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Please log in before trying the leaderboard feature"

Number of calls: 0

[Killed] ConditionalExpression
main/components/Commons/CommonsOverview.js:12:13
 
     let navigate = useNavigate();
     const leaderboardButtonClick = () => {
-        if (currentUser) {navigate("/leaderboard/" + commonsPlus.commons.id);} else {
+        if (false) {navigate("/leaderboard/" + commonsPlus.commons.id);} else {
             // Display a toast message indicating the user should log in
             toast("Please log in before trying the leaderboard feature");
killedBy: CommonsOverview tests Redirects to the LeaderboardPage for an admin when you click visit
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "Please log in before trying the leaderboard feature"

[Killed] LogicalOperator
main/components/Commons/CommonsOverview.js:17:30
             toast("Please log in before trying the leaderboard feature");
         }
     };
-    const showLeaderboard = (hasRole(currentUser, "ROLE_ADMIN") || commonsPlus.commons.showLeaderboard );
+    const showLeaderboard = (hasRole(currentUser, "ROLE_ADMIN") && commonsPlus.commons.showLeaderboard );
     return (
         <Card data-testid="CommonsOverview">
killedBy: CommonsOverview tests Popping out toast messages for visitor
statusReason: Error: Unable to find an element by: [data-testid="user-leaderboard-button"]

<body>
  <div>
    <div
      class="card"
      data-testid="CommonsOverview"
    >

[Killed] ConditionalExpression
main/components/Commons/CommonsOverview.js:17:30
             toast("Please log in before trying the leaderboard feature");
         }
     };
-    const showLeaderboard = (hasRole(currentUser, "ROLE_ADMIN") || commonsPlus.commons.showLeaderboard );
+    const showLeaderboard = (true );
     return (
         <Card data-testid="CommonsOverview">
killedBy: CommonsOverview tests No LeaderboardPage for an ordinary user when commons has showLeaderboard = false
statusReason: Error: expect(received).toThrow()

Received function did not throw
