[Killed] BlockStatement
src/main/utils/MoneyParsing.js:1:35
-export function parseMoney(value) {
-    const prefixes = ["K", "M", "B", "T", "P", "E", "Z", "Y", "R", "Q"];
-    let scaledValue = value;
-    if (value < 0.01){return "0";}
-
-    for (let i = 9; i >= 0; i--) {
-        const scale = Math.pow(10, (i+1) * 3);
-        if (scaledValue >= scale) {
-            const scaled = scaledValue / scale;
-            return scaled.toFixed(3) + prefixes[i];
-        }
-    }
-
-    return scaledValue.toFixed(3);
-}
+export function parseMoney(value) {}
killedBy: PlayPage tests should fetch data when mounted
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  $12.650
Received:
  $undefined

[Killed] StringLiteral
src/main/utils/MoneyParsing.js:2:33
 export function parseMoney(value) {
-    const prefixes = ["K", "M", "B", "T", "P", "E", "Z", "Y", "R", "Q"];
+    const prefixes = ["K", "M", "", "T", "P", "E", "Z", "Y", "R", "Q"];
     let scaledValue = value;
     if (value < 0.01){return "0";}
killedBy: parseMoney function should correctly format values using SI prefixes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "45.645B"
Received: "45.645"

[Killed] StringLiteral
src/main/utils/MoneyParsing.js:2:63
 export function parseMoney(value) {
-    const prefixes = ["K", "M", "B", "T", "P", "E", "Z", "Y", "R", "Q"];
+    const prefixes = ["K", "M", "B", "T", "P", "E", "Z", "Y", "", "Q"];
     let scaledValue = value;
     if (value < 0.01){return "0";}
killedBy: parseMoney function should correctly format values using SI prefixes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "123.456R"
Received: "123.456"

[Killed] EqualityOperator
src/main/utils/MoneyParsing.js:4:9
 export function parseMoney(value) {
     const prefixes = ["K", "M", "B", "T", "P", "E", "Z", "Y", "R", "Q"];
     let scaledValue = value;
-    if (value < 0.01){return "0";}
+    if (value <= 0.01){return "0";}
 
     for (let i = 9; i >= 0; i--) {
killedBy: parseMoney function should return "0" if the value is less than to 0.01
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0.010"
Received: "0"

[Killed] ConditionalExpression
src/main/utils/MoneyParsing.js:4:9
 export function parseMoney(value) {
     const prefixes = ["K", "M", "B", "T", "P", "E", "Z", "Y", "R", "Q"];
     let scaledValue = value;
-    if (value < 0.01){return "0";}
+    if (true){return "0";}
 
     for (let i = 9; i >= 0; i--) {
killedBy: parseMoney function should return "0" if the value is less than to 0.01
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0.020"
Received: "0"

[Killed] EqualityOperator
src/main/utils/MoneyParsing.js:6:21
     let scaledValue = value;
     if (value < 0.01){return "0";}
 
-    for (let i = 9; i >= 0; i--) {
+    for (let i = 9; i > 0; i--) {
         const scale = Math.pow(10, (i+1) * 3);
         if (scaledValue >= scale) {
killedBy: parseMoney function should correctly format values using SI prefixes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1.000K"
Received: "1000.000"

[Killed] BlockStatement
src/main/utils/MoneyParsing.js:6:34
     let scaledValue = value;
     if (value < 0.01){return "0";}
 
-    for (let i = 9; i >= 0; i--) {
-        const scale = Math.pow(10, (i+1) * 3);
-        if (scaledValue >= scale) {
-            const scaled = scaledValue / scale;
-            return scaled.toFixed(3) + prefixes[i];
-        }
-    }
+    for (let i = 9; i >= 0; i--) {}
 
     return scaledValue.toFixed(3);
killedBy: FarmStats tests contains correct content
statusReason: Error: Unable to find an element with the text: /Total Wealth: \$1.000K/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="card"
    >
      <h5

[Killed] ArithmeticOperator
src/main/utils/MoneyParsing.js:7:36
     if (value < 0.01){return "0";}
 
     for (let i = 9; i >= 0; i--) {
-        const scale = Math.pow(10, (i+1) * 3);
+        const scale = Math.pow(10, (i + 1) / 3);
         if (scaledValue >= scale) {
             const scaled = scaledValue / scale;
killedBy: FarmStats tests contains correct content
statusReason: Error: Unable to find an element with the text: /Total Wealth: \$1.000K/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="card"
    >
      <h5

[Killed] ArithmeticOperator
src/main/utils/MoneyParsing.js:7:37
     if (value < 0.01){return "0";}
 
     for (let i = 9; i >= 0; i--) {
-        const scale = Math.pow(10, (i+1) * 3);
+        const scale = Math.pow(10, (i - 1) * 3);
         if (scaledValue >= scale) {
             const scaled = scaledValue / scale;
killedBy: FarmStats tests contains correct content
statusReason: Error: Unable to find an element with the text: /Total Wealth: \$1.000K/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="card"
    >
      <h5

[Killed] EqualityOperator
src/main/utils/MoneyParsing.js:8:13
 
     for (let i = 9; i >= 0; i--) {
         const scale = Math.pow(10, (i+1) * 3);
-        if (scaledValue >= scale) {
+        if (scaledValue < scale) {
             const scaled = scaledValue / scale;
             return scaled.toFixed(3) + prefixes[i];
killedBy: Paged Profit Table tests First Page and basic components are rendered as expected
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  $12.650
Received:
  $0.000Q

<html>

[Killed] BlockStatement
src/main/utils/MoneyParsing.js:8:35
 
     for (let i = 9; i >= 0; i--) {
         const scale = Math.pow(10, (i+1) * 3);
-        if (scaledValue >= scale) {
-            const scaled = scaledValue / scale;
-            return scaled.toFixed(3) + prefixes[i];
-        }
+        if (scaledValue >= scale) {}
     }
 
killedBy: FarmStats tests contains correct content
statusReason: Error: Unable to find an element with the text: /Total Wealth: \$1.000K/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="card"
    >
      <h5

[Killed] ArithmeticOperator
src/main/utils/MoneyParsing.js:9:28
     for (let i = 9; i >= 0; i--) {
         const scale = Math.pow(10, (i+1) * 3);
         if (scaledValue >= scale) {
-            const scaled = scaledValue / scale;
+            const scaled = scaledValue * scale;
             return scaled.toFixed(3) + prefixes[i];
         }
killedBy: FarmStats tests contains correct content
statusReason: Error: Unable to find an element with the text: /Total Wealth: \$1.000K/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="card"
    >
      <h5

[Killed] ArithmeticOperator
src/main/utils/MoneyParsing.js:10:20
         const scale = Math.pow(10, (i+1) * 3);
         if (scaledValue >= scale) {
             const scaled = scaledValue / scale;
-            return scaled.toFixed(3) + prefixes[i];
+            return scaled.toFixed(3) - prefixes[i];
         }
     }
killedBy: FarmStats tests contains correct content
statusReason: Error: Unable to find an element with the text: /Total Wealth: \$1.000K/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="card"
    >
      <h5
