[Killed] BlockStatement
src/main/pages/AdminJobsPage.js:51:49
   );
   // Stryker restore all
 
-  const submitSetCowHealthJob = async (data) => {
-    toast(`Submitted Job: Set Cow Health (Commons: ${data.selectedCommonsName}, Health: ${data.healthValue})`);
-    SetCowHealthMutation.mutate(data);
-  };
+  const submitSetCowHealthJob = async (data) => {};
 
   // *** UpdateCowHealth job ***
killedBy: AdminJobsPage tests user can submit a set cow health job
statusReason: TypeError: Cannot read properties of undefined (reading 'url')

<html>
  <head />
  <body>
    <div>
      <div
        class="d-flex flex-column min-vh-100"

[Killed] StringLiteral
src/main/pages/AdminJobsPage.js:52:11
   // Stryker restore all
 
   const submitSetCowHealthJob = async (data) => {
-    toast(`Submitted Job: Set Cow Health (Commons: ${data.selectedCommonsName}, Health: ${data.healthValue})`);
+    toast(``);
     SetCowHealthMutation.mutate(data);
   };
killedBy: AdminJobsPage tests user can submit a set cow health job
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Submitted Job: Set Cow Health (Commons: Anika's Commons, Health: 10)"
Received: ""

Number of calls: 1

[Killed] ObjectLiteral
src/main/pages/AdminJobsPage.js:63:66
     method: "POST",
   });
 
-  const objectToAxiosParamsUpdateCowHealthJobSingle = (data) => ({
-    url: `/api/jobs/launch/updatecowhealthsinglecommons?commonsId=${data.selectedCommons}`,
-    method: "POST",
-  });
+  const objectToAxiosParamsUpdateCowHealthJobSingle = (data) => ({});
 
   // Stryker disable all
killedBy: AdminJobsPage tests user can submit update cow health job
statusReason: TypeError: Cannot read properties of undefined (reading 'url')

<html>
  <head />
  <body>
    <div>
      <div
        class="d-flex flex-column min-vh-100"

[Killed] BlockStatement
src/main/pages/AdminJobsPage.js:82:52
   );
   // Stryker restore all
 
-  const submitUpdateCowHealthJob = async (data) => {
-    if (data.selectedCommonsName === "All Commons") {
-      toast("Submitted Job: Update Cow Health");
-    UpdateCowHealthMutation.mutate();
-    } else {
-    toast(`Submitted Job: Update Cow Health (Commons: ${data.selectedCommonsName})`);
-    UpdateCowHealthSingleMutation.mutate(data);
-    }
-  };
+  const submitUpdateCowHealthJob = async (data) => {};
 
 
killedBy: AdminJobsPage tests user can submit update cow health job
statusReason: TypeError: Cannot read properties of undefined (reading 'url')

<html>
  <head />
  <body>
    <div>
      <div
        class="d-flex flex-column min-vh-100"

[Killed] BlockStatement
src/main/pages/AdminJobsPage.js:86:12
     if (data.selectedCommonsName === "All Commons") {
       toast("Submitted Job: Update Cow Health");
     UpdateCowHealthMutation.mutate();
-    } else {
-    toast(`Submitted Job: Update Cow Health (Commons: ${data.selectedCommonsName})`);
-    UpdateCowHealthSingleMutation.mutate(data);
-    }
+    } else {}
   };
 
killedBy: AdminJobsPage tests user can submit update cow health job
statusReason: TypeError: Cannot read properties of undefined (reading 'url')

<html>
  <head />
  <body>
    <div>
      <div
        class="d-flex flex-column min-vh-100"

[Killed] BlockStatement
src/main/pages/AdminJobsPage.js:120:48
   );
   // Stryker restore all
 
-  const submitMilkTheCowsJob = async (data) => {
-    if (data.selectedCommonsName === "All Commons") {
-      toast("Submitted Job: Milk The Cows!");
-      MilkTheCowsMutation.mutate();
-    } else {
-    toast(`Submitted Job: Milk The Cows! (Commons: ${data.selectedCommonsName})`);
-    MilkTheCowsSingleMutation.mutate(data);
-    }
-  };
+  const submitMilkTheCowsJob = async (data) => {};
   // *** Instructor Report job ***
 
killedBy: AdminJobsPage tests user can submit milk the cows job
statusReason: TypeError: Cannot read properties of undefined (reading 'url')

<html>
  <head />
  <body>
    <div>
      <div
        class="d-flex flex-column min-vh-100"

[Killed] BlockStatement
src/main/pages/AdminJobsPage.js:124:12
     if (data.selectedCommonsName === "All Commons") {
       toast("Submitted Job: Milk The Cows!");
       MilkTheCowsMutation.mutate();
-    } else {
-    toast(`Submitted Job: Milk The Cows! (Commons: ${data.selectedCommonsName})`);
-    MilkTheCowsSingleMutation.mutate(data);
-    }
+    } else {}
   };
   // *** Instructor Report job ***
killedBy: AdminJobsPage tests user can submit milk the cows job
statusReason: TypeError: Cannot read properties of undefined (reading 'url')

<html>
  <head />
  <body>
    <div>
      <div
        class="d-flex flex-column min-vh-100"

[Killed] StringLiteral
src/main/pages/AdminJobsPage.js:125:11
       toast("Submitted Job: Milk The Cows!");
       MilkTheCowsMutation.mutate();
     } else {
-    toast(`Submitted Job: Milk The Cows! (Commons: ${data.selectedCommonsName})`);
+    toast(``);
     MilkTheCowsSingleMutation.mutate(data);
     }
killedBy: AdminJobsPage tests user can submit milk the cows job
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Submitted Job: Milk The Cows! (Commons: Anika's Commons)"
Received: ""

Number of calls: 1

[Killed] BlockStatement
src/main/pages/AdminJobsPage.js:144:49
   );
   // Stryker restore all
 
-  const submitInstructorReportJob = async () => {
-    toast("Submitted Job: Instructor Report");
-    InstructorReportMutation.mutate();
-  }
+  const submitInstructorReportJob = async () => {}
 
   // *** Instructor Report (Specific Commons) job ***
killedBy: AdminJobsPage tests user can submit instructor report job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
src/main/pages/AdminJobsPage.js:151:75
 
   // *** Instructor Report (Specific Commons) job ***
 
-  const objectToAxiosParamsInstructorReportSpecificCommonsJob = (data) => {
-    return ({
-      url: `/api/jobs/launch/instructorreportsinglecommons?commonsId=${data.selectedCommons}`,
-      method: "POST",
-    });
-
-  };
+  const objectToAxiosParamsInstructorReportSpecificCommonsJob = (data) => {};
   
 // Stryker disable all
killedBy: AdminJobsPage tests user can submit instructor report (specific commons) job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
src/main/pages/AdminJobsPage.js:167:66
 );
 // Stryker restore all
 
-const submitInstructorReportSpecificCommonsJob = async (data) => {
-  toast("Submitted Job: Instructor Report (Specific Commons)");
-  InstructorReportSpecificCommonsMutation.mutate(data);
-}
+const submitInstructorReportSpecificCommonsJob = async (data) => {}
 
 const jobLaunchers = [
killedBy: AdminJobsPage tests user can submit instructor report (specific commons) job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
src/main/pages/AdminJobsPage.js:193:3
     name: "Instructor Report",
     form: <InstructorReportForm submitAction={submitInstructorReportJob} />
   },
-  {
-    name: "Instructor Report (for specific commons)",
-    form: <InstructorReportSpecificCommonsForm submitAction={submitInstructorReportSpecificCommonsJob} />
-  },
+  {},
 ];
 
killedBy: AdminJobsPage tests user can submit instructor report (specific commons) job
statusReason: Error: Unable to find an element with the text: Instructor Report (for specific commons). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
