[Killed] StringLiteral
main/components/Commons/CommonsTable.js:73:20
             id: 'commons.startingDate'
         },
         {
-            Header:'Degradation Rate',
+            Header:"",
             accessor: row => row.commons.degradationRate,
             id: 'commons.degradationRate'
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: Degradation Rate. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display:

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:84:23
         },
         {
             Header: 'Cows',
-            accessor: 'totalCows'
+            accessor: ""
         },
         {
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CommonsTable-cell-row-1-col-totalCows"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] ObjectLiteral
main/components/Commons/CommonsTable.js:86:9
             Header: 'Cows',
             accessor: 'totalCows'
         },
-        {
-            Header: 'Capacity Per User',
-            accessor: row => row.commons.capacityPerUser,
-            id: 'commons.capacityPerUser'
-        },
+        {},
         {
             Header: 'Carrying Capacity',
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!
