[Killed] ArrayDeclaration
main/components/Jobs/MilkCowsJobForm.js:14:5
   const { data: commonsAll } = useBackend(
     ["/api/commons/all"],
     { url: "/api/commons/all" },
-    []
+    ["Stryker was here"]
   );
 
killedBy: MilkTheCowsForm tests the correct parameters are passed to useBackend
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ["/api/commons/all"], {"url": "/api/commons/all"}, []
Received
       1
          ["/api/commons/all"],
          {"url": "/api/commons/all"},
        - Array []

[Killed] StringLiteral
main/components/Jobs/MilkCowsJobForm.js:17:41
     []
   );
 
-  const allCommonsProp = {"id":0,"name":"All Commons"}
+  const allCommonsProp = {"id":0,"name":""}
   
   const commons = [allCommonsProp, ...commonsAll]
killedBy: AdminJobsPage tests user can submit milk the cows job for all commons
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/api/jobs/launch/milkthecowjob"
Received: "/api/jobs/launch/milkthecowjobsinglecommons?commonsId=0"

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/components/Jobs/MilkCowsJobForm.js:17:26
     []
   );
 
-  const allCommonsProp = {"id":0,"name":"All Commons"}
+  const allCommonsProp = {}
   
   const commons = [allCommonsProp, ...commonsAll]
killedBy: MilkTheCowsForm tests the first item in commons array is selected by default
statusReason: Error: Unable to find an element by: [data-testid="MilkTheCowsForm-commons-0"]

<body>
  <div>
    <form
      class=""
    >
      <div
