[Killed] StringLiteral
main/components/Jobs/UpdateCowHealthForm.js:7:56
 import { useBackend } from "main/utils/useBackend";
 import CommonsSelect from "main/components/Commons/CommonsSelect";
 
-function UpdateCowHealthForm( { submitAction, testid = "UpdateCowHealthForm" } ) {
+function UpdateCowHealthForm( { submitAction, testid = "" } ) {
 
   // Stryker restore all
killedBy: AdminJobsPage tests user can submit update cow health job
statusReason: Error: Unable to find an element by: [data-testid="UpdateCowHealthForm-commons-1"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrayDeclaration
main/components/Jobs/UpdateCowHealthForm.js:19:19
 
   const allCommonsProp = {"id":0,"name":"All Commons"}
   
-  const commons = [allCommonsProp, ...commonsAll]
+  const commons = []
 
   const [selectedCommons, setSelectedCommons] = useState(null);
killedBy: AdminJobsPage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'id')
